Yikizi/kratt/hardware/esp32/firmware/recorder/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FATFS_LFN_HEAP=y

# Partition table — NimBLE makes the recorder app exceed ESP-IDF's default 1 MiB slot.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# WiFi / captive portal
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_LWIP_DHCPS_ADD_DNS=y
CONFIG_LWIP_DHCPS_MAX_STATION_NUM=8
CONFIG_LWIP_MAX_SOCKETS=24

# HTTP server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# FATFS — increase max open files (recording + HTTP downloads)
CONFIG_FATFS_FS_LOCK=7

# Bluetooth / NimBLE bridge
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
